Revit 2024 API
InitialColor Properties
The InitialColor type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
TemperatureValue
 The light color temperature value in Kelvins.
See Also
InitialColor Class
Autodesk.Revit.DB.Lighting Namespace